In [4]:
import pandas as pd
d ={ 'Name' : ['Harry','John','Mary','Charly','Henry','Sarah','Emily'],
    'Occupation' : ['Clerk','Accountant','Clerk','Manager','Accountant','Teacher','Teacher'],
    'Salary' : [15000,20000,18000,35000,25000,30000,380000]}
df= pd.DataFrame(d)
df

     Name  Occupation  Salary
0   Harry       Clerk   15000
1    John  Accountant   20000
2    Mary       Clerk   18000
3  Charly     Manager   35000
4   Henry  Accountant   25000
5   Sarah     Teacher   30000
6   Emily     Teacher  380000

In [5]:
print(df['Salary'].mean())

74714.28571428571